[metadata]
creation_date = "2020/11/04"
maturity = "production"
updated_date = "2021/03/03"

[rule]
author = [ "Octodet" ]
description = """
Identifies unusual processes connecting to domains using known free SSL certificates. Adversaries may employ a known
encryption algorithm to conceal command and control traffic.
"""
from = "now-9m"
index = [
  "winlogbeat-*-cipher*",
  "logs-endpoint.events.*-cipher*",
  "logs-windows.*-cipher*"
]
language = "eql"
license = "Elastic License v2"
name = "Connection to Commonly Abused Free SSL Certificate Providers"
risk_score = 21
rule_id = "e3cf38fa-d5b8-46cc-87f9-4a7513e4281d"
severity = "low"
tags = [
  "Elastic",
  "Host",
  "Windows",
  "Threat Detection",
  "Command and Control",
  "WinLogBeat",
  "Elastic-Agent",
  "Endpoint Security"
]
timestamp_override = "event.ingested"
type = "eql"
query = """
network where network.protocol == "dns" and
  /* Add new free SSL certificate provider domains here */
  dns.question.name : ("*letsencrypt.org", "*.sslforfree.com", "*.zerossl.com", "*.freessl.org") and
  
  /* Native Windows process paths that are unlikely to have network connections to domains secured using free SSL certificates */
  process.executable : ("C:\\\\Windows\\\\System32\\\\*.exe",
                        "C:\\\\Windows\\\\System\\\\*.exe",
\t                  "C:\\\\Windows\\\\SysWOW64\\\\*.exe",
\t\t          "C:\\\\Windows\\\\Microsoft.NET\\\\Framework*\\\\*.exe",
\t\t          "C:\\\\Windows\\\\explorer.exe",
\t\t          "C:\\\\Windows\\\\notepad.exe") and
  
  /* Insert noisy false positives here */
  not process.name : ("svchost.exe", "MicrosoftEdge*.exe", "msedge.exe")
"""

  [[rule.threat]]
  framework = "MITRE ATT&CK"

    [[rule.threat.technique]]
    id = "T1573"
    name = "Encrypted Channel"
    reference = "https://attack.mitre.org/techniques/T1573/"

    [rule.threat.tactic]
    id = "TA0011"
    name = "Command and Control"
    reference = "https://attack.mitre.org/tactics/TA0011/"
