[metadata]
creation_date = "2020/02/18"
deprecation_date = "2021/04/15"
maturity = "deprecated"
updated_date = "2021/04/15"

[rule]
author = [ "Octodet" ]
description = "Adversaries may attempt to get information about running processes on a system."
false_positives = [
  "Administrators may use the tasklist command to display a list of currently running processes. By itself, it does not\nindicate malicious activity. After obtaining a foothold, it's possible adversaries may use discovery commands like\ntasklist to get information about running processes.\n"
]
from = "now-9m"
index = [
  "winlogbeat-*-cipher*",
  "logs-endpoint.events.*-cipher*",
  "logs-windows.*-cipher*"
]
language = "kuery"
license = "Elastic License v2"
name = "Process Discovery via Tasklist"
risk_score = 21
rule_id = "cc16f774-59f9-462d-8b98-d27ccd4519ec"
severity = "low"
tags = [
  "Elastic",
  "Host",
  "Windows",
  "Threat Detection",
  "Discovery",
  "WinLogBeat",
  "Elastic-Agent",
  "Endpoint Security"
]
timestamp_override = "event.ingested"
type = "query"
query = """
event.category:process and event.type:(start or process_started) and process.name:tasklist.exe
"""

  [[rule.threat]]
  framework = "MITRE ATT&CK"

    [[rule.threat.technique]]
    id = "T1057"
    name = "Process Discovery"
    reference = "https://attack.mitre.org/techniques/T1057/"

    [rule.threat.tactic]
    id = "TA0007"
    name = "Discovery"
    reference = "https://attack.mitre.org/tactics/TA0007/"
