[metadata]
creation_date = "2020/02/18"
deprecation_date = "2021/04/15"
maturity = "deprecated"
updated_date = "2021/04/15"

[rule]
author = [ "Octodet" ]
description = """
The whoami application was executed on a Linux host. This is often used by tools and persistence mechanisms to test for
privileged access.
"""
false_positives = [
  "Security testing tools and frameworks may run this command. Some normal use of this command may originate from\nautomation tools and frameworks.\n"
]
from = "now-9m"
index = [ "auditbeat-*-cipher*", "logs-endpoint.events.*-cipher*" ]
language = "kuery"
license = "Elastic License v2"
name = "User Discovery via Whoami"
risk_score = 21
rule_id = "120559c6-5e24-49f4-9e30-8ffe697df6b9"
severity = "low"
tags = [
  "Elastic",
  "Host",
  "Linux",
  "Threat Detection",
  "Discovery",
  "AuditBeat",
  "Elastic-Agent",
  "Endpoint Security"
]
timestamp_override = "event.ingested"
type = "query"
query = """
event.category:process and event.type:(start or process_started) and process.name:whoami
"""

  [[rule.threat]]
  framework = "MITRE ATT&CK"

    [[rule.threat.technique]]
    id = "T1033"
    name = "System Owner/User Discovery"
    reference = "https://attack.mitre.org/techniques/T1033/"

    [rule.threat.tactic]
    id = "TA0007"
    name = "Discovery"
    reference = "https://attack.mitre.org/tactics/TA0007/"
