[metadata]
creation_date = "2021/06/24"
maturity = "production"
updated_date = "2021/06/24"
integration = "azure"

[rule]
author = [ "Octodet" ]
description = """
Identifies the deletion of Azure Kubernetes Pods. Adversary may delete a kubernetes pod to disrupt the normal behavior of the environment.
"""
false_positives = [
  "Pods may be deleted by a system administrator. Verify whether the user identity, user agent, and/or hostname\nshould be making changes in your environment. Pods deletions from unfamiliar users or hosts should be\ninvestigated. If known behavior is causing false positives, it can be exempted from the rule.\n"
]
from = "now-25m"
index = [ "filebeat-*-cipher*", "logs-azure*-cipher*" ]
language = "kuery"
license = "Elastic License v2"
name = "Azure Kubernetes Pods Deleted"
note = """
## Config

The Azure Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."""
references = [
  "https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations#microsoftkubernetes"
]
risk_score = 47
rule_id = "83a1931d-8136-46fc-b7b9-2db4f639e014"
severity = "medium"
tags = [
  "Elastic",
  "Cloud",
  "Azure",
  "Continuous Monitoring",
  "SecOps",
  "Asset Visibility",
  "FileBeat",
  "Elastic-Agent"
]
timestamp_override = "event.ingested"
type = "query"
query = """
event.dataset:azure.activitylogs and azure.activitylogs.operation_name:"MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/PODS/DELETE" and 
event.outcome:(Success or success)
"""

  [[rule.threat]]
  framework = "MITRE ATT&CK"

    [rule.threat.tactic]
    id = "TA0040"
    name = "Impact"
    reference = "https://attack.mitre.org/tactics/TA0040/"
